ab_logs/01-simple_responses/grape_puma_jbuilder_ab_n1kc6_random.log
This is ApacheBench, Version 2.3 <$Revision: 1796539 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            9292

Document Path:          /random
Document Length:        25 bytes

Concurrency Level:      6
Time taken for tests:   1.328 seconds
Complete requests:      1000
Failed requests:        255
   (Connect: 0, Receive: 0, Length: 255, Exceptions: 0)
Total transferred:      95713 bytes
HTML transferred:       24713 bytes
Requests per second:    753.28 [#/sec] (mean)
Time per request:       7.965 [ms] (mean)
Time per request:       1.328 [ms] (mean, across all concurrent requests)
Transfer rate:          70.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     2    8   3.0      7      18
Waiting:        2    7   2.7      7      18
Total:          2    8   3.0      7      18

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      9
  75%     10
  80%     10
  90%     12
  95%     14
  98%     15
  99%     16
 100%     18 (longest request)