ab_logs/01-simple_responses/grape_puma_jbuilder_ab_n1kc6_static.log
This is ApacheBench, Version 2.3 <$Revision: 1796539 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            9292

Document Path:          /static
Document Length:        17 bytes

Concurrency Level:      6
Time taken for tests:   1.319 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      88000 bytes
HTML transferred:       17000 bytes
Requests per second:    758.33 [#/sec] (mean)
Time per request:       7.912 [ms] (mean)
Time per request:       1.319 [ms] (mean, across all concurrent requests)
Transfer rate:          65.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     1    8   3.1      7      21
Waiting:        1    7   2.9      6      20
Total:          1    8   3.1      7      21

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      9
  75%     10
  80%     10
  90%     12
  95%     14
  98%     15
  99%     16
 100%     21 (longest request)