ab_logs/01-simple_responses/grape_puma_jbuilder_oj_ab_n1kc6_random.log
This is ApacheBench, Version 2.3 <$Revision: 1796539 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            9292

Document Path:          /random
Document Length:        25 bytes

Concurrency Level:      6
Time taken for tests:   1.332 seconds
Complete requests:      1000
Failed requests:        276
   (Connect: 0, Receive: 0, Length: 276, Exceptions: 0)
Total transferred:      95698 bytes
HTML transferred:       24698 bytes
Requests per second:    750.76 [#/sec] (mean)
Time per request:       7.992 [ms] (mean)
Time per request:       1.332 [ms] (mean, across all concurrent requests)
Transfer rate:          70.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     2    8   3.2      7      21
Waiting:        2    7   2.9      6      19
Total:          2    8   3.2      7      21

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      9
  75%     10
  80%     10
  90%     13
  95%     14
  98%     16
  99%     17
 100%     21 (longest request)