ab_logs/01-simple_responses/grape_webrick_ab_n1kc6_random.log
This is ApacheBench, Version 2.3 <$Revision: 1796539 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        localhost
Server Port:            9292

Document Path:          /random
Document Length:        24 bytes

Concurrency Level:      6
Time taken for tests:   1.903 seconds
Complete requests:      1000
Failed requests:        751
   (Connect: 0, Receive: 0, Length: 751, Exceptions: 0)
Total transferred:      199695 bytes
HTML transferred:       24695 bytes
Requests per second:    525.55 [#/sec] (mean)
Time per request:       11.417 [ms] (mean)
Time per request:       1.903 [ms] (mean, across all concurrent requests)
Transfer rate:          102.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     4   11   3.6     11      25
Waiting:        3   10   3.2      9      21
Total:          4   11   3.6     11      25

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     13
  75%     14
  80%     14
  90%     17
  95%     18
  98%     19
  99%     21
 100%     25 (longest request)