ab_logs/01-simple_responses/grape_webrick_jbuilder_ab_n1kc6_random.log
This is ApacheBench, Version 2.3 <$Revision: 1796539 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        localhost
Server Port:            9292

Document Path:          /random
Document Length:        25 bytes

Concurrency Level:      6
Time taken for tests:   1.929 seconds
Complete requests:      1000
Failed requests:        235
   (Connect: 0, Receive: 0, Length: 235, Exceptions: 0)
Total transferred:      199733 bytes
HTML transferred:       24733 bytes
Requests per second:    518.51 [#/sec] (mean)
Time per request:       11.572 [ms] (mean)
Time per request:       1.929 [ms] (mean, across all concurrent requests)
Transfer rate:          101.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     3   11   3.8     11      24
Waiting:        2   10   3.4      9      23
Total:          3   12   3.8     11      25

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     13
  75%     14
  80%     15
  90%     17
  95%     19
  98%     20
  99%     21
 100%     25 (longest request)