ab_logs/01-simple_responses/grape_webrick_jbuilder_ab_n1kc6_static.log
This is ApacheBench, Version 2.3 <$Revision: 1796539 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        localhost
Server Port:            9292

Document Path:          /static
Document Length:        17 bytes

Concurrency Level:      6
Time taken for tests:   1.910 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      192000 bytes
HTML transferred:       17000 bytes
Requests per second:    523.67 [#/sec] (mean)
Time per request:       11.458 [ms] (mean)
Time per request:       1.910 [ms] (mean, across all concurrent requests)
Transfer rate:          98.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     3   11   3.8     11      28
Waiting:        2   10   3.5      9      26
Total:          3   11   3.8     11      28

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     13
  75%     14
  80%     15
  90%     17
  95%     19
  98%     20
  99%     22
 100%     28 (longest request)